src/InformationRegisters/ПубличныеИдентификаторыОбъектовУправлениеПерсоналом/ПубличныеИдентификаторыОбъектовУправлениеПерсоналом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПубличныеИдентификаторыОбъектовУправлениеПерсоналом</name>
  <resources>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>DefinedType.СсылкаПубличныйИдентификаторУправлениеПерсоналом</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОбъекта</name>
    <type>
      <types>EnumRef.ТипыОбъектовИнтеграцияУпралениеПерсоналом</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИзмененияДляОбменаКабинетСотрудника/ИзмененияДляОбменаКабинетСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзмененияДляОбменаКабинетСотрудника</name>
  <resources>
    <name>ВерсияДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыгружатьУдаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>DefinedType.СсылкаИзменениеКабинетСотрудника</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОбъекта</name>
    <type>
      <types>EnumRef.ТипыОбъектовИнтеграцияУпралениеПерсоналом</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ТипыОбъектовИнтеграцияУпралениеПерсоналом/ТипыОбъектовИнтеграцияУпралениеПерсоналом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектовИнтеграцияУпралениеПерсоналом</name>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>Организация</name>
  </enumValues>
  <enumValues>
    <name>Подразделение</name>
  </enumValues>
  <enumValues>
    <name>Должность</name>
  </enumValues>
  <enumValues>
    <name>ДолжностьПоШтатномуРасписанию</name>
  </enumValues>
  <enumValues>
    <name>Сотрудник</name>
  </enumValues>
  <enumValues>
    <name>ГрафикРаботы</name>
  </enumValues>
  <enumValues>
    <name>ГрафикОтпусковПредприятия</name>
  </enumValues>
  <enumValues>
    <name>ГрафикОтпусковПодразделения</name>
  </enumValues>
  <enumValues>
    <name>ВерсииФормата</name>
  </enumValues>
  <enumValues>
    <name>ВсеИзменения</name>
  </enumValues>
  <enumValues>
    <name>ВидПредоставляемойСотрудникамСправки</name>
  </enumValues>
  <enumValues>
    <name>Оффер</name>
  </enumValues>
  <enumValues>
    <name>ОграничениеДоступаКРабочимКонтактам</name>
  </enumValues>
  <enumValues>
    <name>ДоступныеФункцииФизическогоЛица</name>
  </enumValues>
  <enumValues>
    <name>ДокументНаПодпись</name>
  </enumValues>
  <enumValues>
    <name>СогласиеНаПрисоединениеККЭДО</name>
  </enumValues>
  <enumValues>
    <name>МашиночитаемаяДоверенностьКЭДО</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСправки2НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСправкиСМестаРаботы</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаИзменениеЛичныхДанных</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНалоговыйВычет</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаОтпуск</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаКомпенсациюОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаОстаткиОтпусков</name>
  </enumValues>
  <enumValues>
    <name>Отсутствие</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаДСВ</name>
  </enumValues>
  <enumValues>
    <name>ГрафикОтпусков</name>
  </enumValues>
  <enumValues>
    <name>ЗаработанныеПраваНаОтпуск</name>
  </enumValues>
  <enumValues>
    <name>ПрименяемыеВычетыНДФЛ</name>
  </enumValues>
  <enumValues>
    <name>ПраздничныеДниГрафикаРаботы</name>
  </enumValues>
  <enumValues>
    <name>РезультатСогласования</name>
  </enumValues>
  <enumValues>
    <name>ПравилоСогласования</name>
  </enumValues>
  <enumValues>
    <name>РасчетныйЛисток</name>
  </enumValues>
  <enumValues>
    <name>ПлановоеУдержание</name>
  </enumValues>
  <enumValues>
    <name>БудущееИзменениеОстаткаОтпусков</name>
  </enumValues>
  <enumValues>
    <name>ДанныеГрафикаРаботы</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияОбИспользованииОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ВидСоставнойЧастиЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>Справка2НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>СправкаСМестаРаботы</name>
  </enumValues>
  <enumValues>
    <name>СправкаОстаткиОтпусков</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыЗаявокКабинетСотрудника/ТипыЗаявокКабинетСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗаявокКабинетСотрудника</name>
  <enumValues>
    <name>СправкаНДФЛ</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаКомпенсациюОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеЛичныхДанных</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаУдержаниеДСВ</name>
  </enumValues>
  <enumValues>
    <name>СправкаСМестаРаботы</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаОтпуск</name>
  </enumValues>
  <enumValues>
    <name>СправкаОбОстаткеОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаНалоговыеВычеты</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОтсутствия</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ДокументКадровогоЭДО/ДокументКадровогоЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДокументКадровогоЭДО</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйДокумент</name>
    <type>
      <types>DefinedType.ПрисоединенныйФайлПечатнойФормы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеДокумента</name>
    <type>
      <types>DefinedType.ОбъектСПечатнымиФормами</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЭлектронныйДокумент</name>
    <type>
      <types>DefinedType.ПрисоединенныйФайл</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОснованиеДокумента</name>
    <type>
      <types>DefinedType.ВладелецПрисоединенныхФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗаявкиКабинетСотрудника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>72</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияДокумента</name>
    <type>
      <types>EnumRef.КатегорииДокументовКадровогоЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <comment>АПК:58 Краткий перечень сотрудников, включенных в документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержимоеДокумента</name>
    <type>
      <types>EnumRef.СодержимоеДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Внешний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПодписанСотрудником</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаСписокСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДокументаКадровогоМероприятия</name>
    <type>
      <types>CatalogRef.КодыДокументовКадровыхМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <comment>Расширение файла версии</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеПодписанты</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховойНомерПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Гражданство</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПоУмолчанию</name>
    <comment>Банковский счет по умолчанию</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновныеСведения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоРождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>240</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Дата регистрации</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСлужебное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПостоянноПроживалВКрыму18Марта2014Года</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Инициалы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИнициалыИмени</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрименяетсяФЗ_20_2023</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/ИнтеграцияУправлениеПерсоналомСлужебный/Module.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ЗагрузитьФизическоеЛицо(Объект, ИдентификаторСсылка) Экспорт
	
	Идентификатор = Объект.ФизическоеЛицо;
	
	ДанныеОбъекта = Новый Структура("
	|Фамилия,
	|Имя,
	|Отчество,
	|Пол,
	|ДатаРождения,
	|ИНН,
	|СтраховойНомерПФР,
	|МестоРожденияПредставление,
	|ДокументУдостоверяющийЛичность,
	|ТелефонМобильныйПредставление,
	|EMailПредставление,
	|Фотография");
	ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Объект);
	
	Настройки = РегистрыСведений.НастройкиИнтеграцииУправлениеПерсоналом.Настройки();
	ВидКИМобильныйТелефон = Настройки.ВидКИМобильныйТелефон;
	ВидКИАдресЭлектроннойПочты = Настройки.ВидКИАдресЭлектроннойПочты;
	
	ФизическоеЛицоОбъект = Неопределено;
	
	Ссылка = ИдентификаторСсылка[Идентификатор];
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ФизическоеЛицоОбъект = Ссылка.ПолучитьОбъект();
	Иначе
		
		СсылкаНаОбъект = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));
		Если ОбщегоНазначения.СсылкаСуществует(СсылкаНаОбъект) Тогда
			Ссылка = СсылкаНаОбъект;
		Иначе
			
			Запрос = Новый Запрос;
			// поиск по СтраховойНомерПФР
			Если ЗначениеЗаполнено(ДанныеОбъекта.СтраховойНомерПФР) Тогда
				Запрос.УстановитьПараметр("СтраховойНомерПФР", ДанныеОбъекта.СтраховойНомерПФР);
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ФизическиеЛица.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.ФизическиеЛица КАК ФизическиеЛица
				|ГДЕ
				|	ФизическиеЛица.СтраховойНомерПФР = &СтраховойНомерПФР";
				РезультатЗапроса = Запрос.Выполнить();
				Если Не РезультатЗапроса.Пустой() Тогда
					Выборка = РезультатЗапроса.Выбрать();
					Выборка.Следующий();
					Ссылка = Выборка.Ссылка;
				КонецЕсли;
			КонецЕсли;
			
			// поиск по ИНН
			Если Не ЗначениеЗаполнено(Ссылка) И ЗначениеЗаполнено(ДанныеОбъекта.ИНН) Тогда
				Запрос.УстановитьПараметр("ИНН", ДанныеОбъекта.ИНН);
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ФизическиеЛица.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.ФизическиеЛица КАК ФизическиеЛица
				|ГДЕ
				|	ФизическиеЛица.ИНН = &ИНН";
				РезультатЗапроса = Запрос.Выполнить();
				Если Не РезультатЗапроса.Пустой() Тогда
					Выборка = РезультатЗапроса.Выбрать();
					Выборка.Следующий();
					Ссылка = Выборка.Ссылка;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка) Тогда
			ФизическоеЛицоОбъект = Ссылка.ПолучитьОбъект();
		КонецЕсли;
		
	КонецЕсли;
	
	Записывать = Ложь;
	Если ФизическоеЛицоОбъект = Неопределено Тогда
		
		Записывать = Истина;
		
		ФИО = Новый Структура("Фамилия,Имя,Отчество");
		ЗаполнитьЗначенияСвойств(ФИО, ДанныеОбъекта);
		
		АдресФотографии = "";
		Если ЗначениеЗаполнено(ДанныеОбъекта.Фотография) Тогда
			АдресФотографии = ПоместитьВоВременноеХранилище(ДанныеОбъекта.Фотография.ДвоичныеДанные);
		КонецЕсли;
		
		КонтактнаяИнформация = Новый Массив;
		Если ЗначениеЗаполнено(ДанныеОбъекта.ТелефонМобильныйПредставление) Тогда
			ОписаниеКонтактнойИнформации = КадровыйУчет.НоваяКонтактнаяИнформация();
			ОписаниеКонтактнойИнформации.ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(
					ДанныеОбъекта.ТелефонМобильныйПредставление, ВидКИМобильныйТелефон);
			ОписаниеКонтактнойИнформации.Вставить("ВидИнформации", ВидКИМобильныйТелефон);
			ОписаниеКонтактнойИнформации.Вставить("ТипИнформации", Перечисления.ТипыКонтактнойИнформации.Телефон);
			КонтактнаяИнформация.Добавить(ОписаниеКонтактнойИнформации); 
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеОбъекта.EMailПредставление) Тогда
			ОписаниеКонтактнойИнформации = КадровыйУчет.НоваяКонтактнаяИнформация();
			ОписаниеКонтактнойИнформации.ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(
					ДанныеОбъекта.EMailПредставление, ВидКИАдресЭлектроннойПочты);
			ОписаниеКонтактнойИнформации.Вставить("ВидИнформации", ВидКИАдресЭлектроннойПочты);
			ОписаниеКонтактнойИнформации.Вставить("ТипИнформации", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			КонтактнаяИнформация.Добавить(ОписаниеКонтактнойИнформации);
		КонецЕсли;
		
		ДанныеФизическогоЛица = КадровыйУчет.НовыеДанныеФизическогоЛица();
		ЗаполнитьЗначенияСвойств(ДанныеФизическогоЛица, ДанныеОбъекта);
		ДанныеФизическогоЛица.МестоРождения 		= ДанныеОбъекта.МестоРожденияПредставление;
		ДанныеФизическогоЛица.КонтактнаяИнформация 	= КонтактнаяИнформация;
		ДанныеФизическогоЛица.АдресФотографии 		= АдресФотографии;
		
		ФизическоеЛицоОбъект = КадровыйУчет.НовоеФизическоеЛицо(ФИО, ДанныеФизическогоЛица,,Ложь);
		
		СсылкаНового = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));
		ФизическоеЛицоОбъект.УстановитьСсылкуНового(СсылкаНового);
		
	Иначе
		
		// Ссылка может существовать, но объект будет пустой, в случае
		// загрузки, например Оффера, раньше загрузки объекта ФизическоеЛицо.
		
		СвязанныеОбъекты = Новый Структура;
		
		Наименование = ДанныеОбъекта.Фамилия;
		Если ЗначениеЗаполнено(ДанныеОбъекта.Имя) Тогда
			Наименование = СтрШаблон("%1 %2", Наименование, ДанныеОбъекта.Имя);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеОбъекта.Отчество) Тогда
			Наименование = СтрШаблон("%1 %2", Наименование, ДанныеОбъекта.Отчество);
		КонецЕсли;
		
		// Заполняем пустые свойства физического лица.
		Если ПустаяСтрока(ФизическоеЛицоОбъект.Наименование) Тогда
			ФизическоеЛицоОбъект.Наименование = Наименование;
			Записывать = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ФизическоеЛицоОбъект.ДатаРождения) И ЗначениеЗаполнено(ДанныеОбъекта.ДатаРождения) Тогда
			ФизическоеЛицоОбъект.ДатаРождения = ДанныеОбъекта.ДатаРождения;
			Записывать = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ФизическоеЛицоОбъект.Пол) И ЗначениеЗаполнено(ДанныеОбъекта.Пол) Тогда
			ФизическоеЛицоОбъект.Пол = ДанныеОбъекта.Пол;
			Записывать = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ФизическоеЛицоОбъект.ИНН) И ЗначениеЗаполнено(ДанныеОбъекта.ИНН) Тогда
			ФизическоеЛицоОбъект.ИНН = ДанныеОбъекта.ИНН;
			Записывать = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ФизическоеЛицоОбъект.СтраховойНомерПФР) И ЗначениеЗаполнено(ДанныеОбъекта.СтраховойНомерПФР) Тогда
			ФизическоеЛицоОбъект.СтраховойНомерПФР = ДанныеОбъекта.СтраховойНомерПФР;
			Записывать = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ФизическоеЛицоОбъект.ФИО) Тогда
			ФизическоеЛицоОбъект.ФИО = Наименование;
			ФизическоеЛицоОбъект.ДополнительныеСвойства.Вставить("ФИОУстановлены", Истина); 
			ФИО = Новый Структура("Фамилия,Имя,Отчество");
			ЗаполнитьЗначенияСвойств(ФИО, ДанныеОбъекта);
			ДанныеФИО = Новый Структура;
			ДанныеФИО.Вставить("ФИО", ФИО);
			ДанныеФИО.Вставить("Период", Неопределено);
			СвязанныеОбъекты.Вставить("ФИО", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеФИО));
			Записывать = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ФизическоеЛицоОбъект.Пол) Тогда
			ФизическоеЛицоОбъект.Пол = ДанныеОбъекта.Пол;
			Записывать = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СвязанныеОбъекты) Тогда
			ФизическоеЛицоОбъект.ДополнительныеСвойства.Вставить("СвязанныеОбъекты", СвязанныеОбъекты);
		КонецЕсли;
		
		КонтактнаяИнформация = ИнтеграцияУправлениеПерсоналом.КонтактнаяИнформацияФизическихЛиц(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ссылка));
		
		МобильныйТелефон = КонтактнаяИнформация.МобильныеТелефоны[Ссылка];
		Если Не ЗначениеЗаполнено(МобильныйТелефон) И ЗначениеЗаполнено(ДанныеОбъекта.ТелефонМобильныйПредставление) Тогда
			Записывать = Истина;
			ОписаниеКонтактнойИнформации = КадровыйУчет.НоваяКонтактнаяИнформация();
			ОписаниеКонтактнойИнформации.ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(
					ДанныеОбъекта.ТелефонМобильныйПредставление, ВидКИМобильныйТелефон);
			ОписаниеКонтактнойИнформации.Вставить("ВидИнформации", ВидКИМобильныйТелефон);
			ОписаниеКонтактнойИнформации.Вставить("ТипИнформации", Перечисления.ТипыКонтактнойИнформации.Телефон);
			УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ФизическоеЛицоОбъект,
					ОписаниеКонтактнойИнформации.ЗначенияПолей, ОписаниеКонтактнойИнформации.ВидИнформации,
					ОписаниеКонтактнойИнформации.ТипИнформации);
		КонецЕсли;
		
		АдресПочты = КонтактнаяИнформация.АдресаПочты[Ссылка];
		Если Не ЗначениеЗаполнено(АдресПочты) И ЗначениеЗаполнено(ДанныеОбъекта.EMailПредставление) Тогда
			Записывать = Истина;
			ОписаниеКонтактнойИнформации = КадровыйУчет.НоваяКонтактнаяИнформация();
			ОписаниеКонтактнойИнформации.ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(
					ДанныеОбъекта.EMailПредставление, ВидКИАдресЭлектроннойПочты);
			ОписаниеКонтактнойИнформации.Вставить("ВидИнформации", ВидКИАдресЭлектроннойПочты);
			ОписаниеКонтактнойИнформации.Вставить("ТипИнформации", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ФизическоеЛицоОбъект,
					ОписаниеКонтактнойИнформации.ЗначенияПолей, ОписаниеКонтактнойИнформации.ВидИнформации,
					ОписаниеКонтактнойИнформации.ТипИнформации);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Записывать Тогда
		
		НачатьТранзакцию();
		Попытка
			
			Если ЗначениеЗаполнено(Ссылка) Тогда
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокиновки = Блокировка.Добавить("Справочник.ФизическиеЛица");
				ЭлементБлокиновки.УстановитьЗначение("Ссылка", Ссылка);
				Блокировка.Заблокировать();
			КонецЕсли;
			
			ФизическоеЛицоОбъект.Записать();
			Если Не ЗначениеЗаполнено(Ссылка) Тогда
				МенеджерЗаписи = РегистрыСведений.ПубличныеИдентификаторыОбъектовУправлениеПерсоналом.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Идентификатор 	= Идентификатор;
				МенеджерЗаписи.Ссылка 			= ФизическоеЛицоОбъект.Ссылка;
				МенеджерЗаписи.ТипОбъекта 		= Перечисления.ТипыОбъектовИнтеграцияУпралениеПерсоналом.ФизическоеЛицо;
				МенеджерЗаписи.Записать();
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЕсли;

КонецПроцедуры

#Область ОбработкаОфферов

Функция ОфферИдентификаторДокументаСсылка(Идентификаторы) Экспорт
	
	ИдентификаторДокументаСсылка = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Идентификаторы", Идентификаторы);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Оффер.Ссылка КАК Ссылка,
	|	Оффер.ИдентификаторДокумента КАК ИдентификаторДокумента
	|ИЗ
	|	Документ.Оффер КАК Оффер
	|ГДЕ
	|	Оффер.ИдентификаторДокумента В(&Идентификаторы)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ИдентификаторДокументаСсылка.Вставить(Выборка.ИдентификаторДокумента, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат ИдентификаторДокументаСсылка;

КонецФункции

Процедура ЗагрузитьОффер(Объект) Экспорт

	СтруктураЗаполнения = Документы.Оффер.СтруктураЗаполнения();
	ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Объект);
	ДокументОбъект = Документы.Оффер.НовыйДокумент(СтруктураЗаполнения);
	
	Попытка
		ДокументОбъект.Записать();
	Исключение
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область ОбработкаЗаявок

Функция ПараметрыСозданияЗаявок(СписокФизическихЛиц, ТаблицаЗаявок) Экспорт

	Возврат БизнесПроцессыЗаявокСотрудников.ПараметрыСозданияБизнесПроцессовПоЗаявкамСервиса(СписокФизическихЛиц, ТаблицаЗаявок);

КонецФункции

Процедура СоздатьЗаявку(ДанныеЗаявки, ПараметрыЗаявок) Экспорт

	Объект = ДанныеЗаявки.Объект;
	
	ИмяТаблицы = ДанныеЗаявки.ИмяТаблицы;
	ОписаниеБизнесПроцесса = ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыЗаявок.ОписанияБизнесПроцессов[ИмяТаблицы]);
	ОписаниеБизнесПроцесса.ТипЗаявкиКабинетСотрудника 	= ДанныеЗаявки.ТипЗаявки;
	ОписаниеБизнесПроцесса.ИдентификаторЗаявки 			= ДанныеЗаявки.ИдентификаторЗаявки;
	ОписаниеБизнесПроцесса.Вложения 					= ДанныеЗаявки.Вложения;
	ОписаниеБизнесПроцесса.ЭлектронныйДокумент 			= ДанныеЗаявки.ЭлектронныйДокумент;
	
	СвойстваОтветовПоЗаявкам =  "КоличествоЭкземпляров,ОтправлятьEmail,АдресEmail";
	Если ДанныеЗаявки.ТипЗаявки = Перечисления.ТипыЗаявокКабинетСотрудника.СправкаНДФЛ Тогда
		
		ЗаполнитьЗначенияСвойств(ОписаниеБизнесПроцесса, Объект, СвойстваОтветовПоЗаявкам);
		
		ОписаниеБизнесПроцесса.Организация 			 = Объект.Организация;
		ОписаниеБизнесПроцесса.ФизическоеЛицо 		 = Объект.ФизическоеЛицо;
		ОписаниеБизнесПроцесса.КомментарийСотрудника = Объект.Комментарий;
		ОписаниеБизнесПроцесса.ВариантФормированияФайлаОтвета = Объект.ВариантПолученияДокументаРезультата;
		
		Если Объект.Назначение2НДФЛ = "ПодтверждениеДоходов" Тогда
			ОписаниеБизнесПроцесса.НачалоПериода 		= Объект.НачалоПериода;
			ОписаниеБизнесПроцесса.ОкончаниеПериода 	= Объект.ОкончаниеПериода;
			ОписаниеБизнесПроцесса.СпособФормирования 	= Перечисления.ПорядокФормированияСправкиОДоходахФизическогоЛица.Сводно;
		Иначе
			ОписаниеБизнесПроцесса.НалоговыйПериод 		= Объект.НалоговыйПериод;
			ОписаниеБизнесПроцесса.СпособФормирования 	= Перечисления.ПорядокФормированияСправкиОДоходахФизическогоЛица.ВРазрезеКодовОКАТО;
		КонецЕсли; 
		
	ИначеЕсли ДанныеЗаявки.ТипЗаявки = Перечисления.ТипыЗаявокКабинетСотрудника.СправкаСМестаРаботы Тогда
		
		ЗаполнитьЗначенияСвойств(ОписаниеБизнесПроцесса, Объект, СвойстваОтветовПоЗаявкам);
		
		ОписаниеБизнесПроцесса.Организация 			 = Объект.Организация;
		ОписаниеБизнесПроцесса.ФизическоеЛицо 		 = Объект.ФизическоеЛицо;
		ОписаниеБизнесПроцесса.КомментарийСотрудника = Объект.Комментарий;
		ОписаниеБизнесПроцесса.ВариантФормированияФайлаОтвета = Объект.ВариантПолученияДокументаРезультата;
		
		ОписаниеБизнесПроцесса.НазначениеСправки = Объект.НазначениеСправкиСРаботыСтрока;
		
		ВидСправки = Неопределено;
		Если Объект.Свойство("ВидСправки", ВидСправки) Тогда
			ОписаниеБизнесПроцесса.ВидСправки = ВидСправки;
		КонецЕсли;
		
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		БизнесПроцессыЗаявокСотрудников.СоздатьБизнесПроцессПоЗаявке(ИмяТаблицы, ОписаниеБизнесПроцесса, ПараметрыЗаявок);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область СборГрафиковОтпусковПодразделения

Функция ДокументыСборГрафиковОтпусковПоИдентификаторам(Идентификаторы, МодульСборГрафиковОтпусков) Экспорт

	Возврат МодульСборГрафиковОтпусков.ДокументыПоИдентификаторам(Идентификаторы)

КонецФункции

Процедура ЗагрузитьСборГрафиковОтпусковПодразделения(Объект, ИдентификаторыДокументы, МодульСборГрафиковОтпусков) Экспорт
	
	ОписаниеДокумента = МодульСборГрафиковОтпусков.ОписаниеДокументаГрафикПодразделения();
	ОписаниеДокумента.Год 								= Объект.Год;
	ОписаниеДокумента.Подразделение 					= Объект.Подразделение;
	ОписаниеДокумента.ИдентификаторДокумента 			= Объект.ИдентификаторДокумента;
	ОписаниеДокумента.СостояниеСбораГрафиковОтпусков 	= Объект.Состояние;
	ОписаниеДокумента.ОтветственныйЗаСбор 				= Объект.Ответственный;
	Для каждого ЗаписьПериода Из Объект.Периоды Цикл
		НоваяСтрока = ОписаниеДокумента.Периоды.Добавить();
		НоваяСтрока.ФизическоеЛицо 	= ЗаписьПериода.ФизическоеЛицо;
		НоваяСтрока.ДатаНачала 		= ЗаписьПериода.ДатаНачала;
		НоваяСтрока.ДатаОкончания 	= ЗаписьПериода.ДатаОкончания;
	КонецЦикла;
	
	МодульСборГрафиковОтпусков.ОбработатьНовыйГрафикПодразделения(ОписаниеДокумента, ИдентификаторыДокументы);

КонецПроцедуры 

Процедура ЗагрузитьСборГрафиковОтпусковПредприятия(Объект, ИдентификаторыДокументы, МодульСборГрафиковОтпусков) Экспорт
	
	ОписаниеДокумента = МодульСборГрафиковОтпусков.ОписаниеДокументаГрафикПредприятия();
	ОписаниеДокумента.Год 								= Объект.Год;
	ОписаниеДокумента.ИдентификаторДокумента 			= Объект.ИдентификаторДокумента;
	ОписаниеДокумента.СостояниеСбораГрафиковОтпусков 	= Объект.Состояние;
	
	МодульСборГрафиковОтпусков.ОбработатьНовыйГрафикПредприятия(ОписаниеДокумента, ИдентификаторыДокументы);

КонецПроцедуры

#КонецОбласти

#Область РегистрацияДокументовНаПодпись

Процедура ЗарегистрироватьДокументыНаПодпись() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ЗаданияКИсполнению = РегистрыСведений.ЗапланированныеДействияСФайламиДокументовКЭДО.ФайлыКОбработке(
		Ложь, Перечисления.ДействияСФайламиДокументовКЭДО.ПередатьВКабинетСотрудников);
	УстановитьПривилегированныйРежим(Ложь);
	
	СписокФайлов = ЗаданияКИсполнению.Получить(Перечисления.ДействияСФайламиДокументовКЭДО.ПередатьВКабинетСотрудников);
	Если СписокФайлов <> Неопределено Тогда
		ЗарегистрироватьИзмененияДокументовКадровогоЭДО(СписокФайлов)
	КонецЕсли;
	
КонецПроцедуры 

Процедура ЗарегистрироватьИзмененияДокументовКадровогоЭДО(СписокФайлов)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокФайлов", СписокФайлов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументКадровогоЭДО.Ссылка КАК Ссылка,
	|	ДокументКадровогоЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовИнтеграцияУпралениеПерсоналом.ДокументНаПодпись) КАК ТипОбъекта
	|ИЗ
	|	Документ.ДокументКадровогоЭДО КАК ДокументКадровогоЭДО
	|ГДЕ
	|	ДокументКадровогоЭДО.ЭлектронныйДокумент В(&СписокФайлов)";
	
	РезультатЗапроса = Запрос.Выполнить();
	ОбработанныеФайлы = Новый Массив;
	Если Не РезультатЗапроса.Пустой() Тогда
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ИзмененияДляОбменаКабинетСотрудника");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ТипОбъекта", "ТипОбъекта");
			Блокировка.Заблокировать();
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				ОбработанныеФайлы.Добавить(Выборка.ЭлектронныйДокумент);
				МенеджерЗаписи = РегистрыСведений.ИзмененияДляОбменаКабинетСотрудника.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Ссылка 		= Выборка.Ссылка;
				МенеджерЗаписи.ТипОбъекта 	= Выборка.ТипОбъекта;
				МенеджерЗаписи.ВерсияДанных = Строка(Новый УникальныйИдентификатор);
				МенеджерЗаписи.Записать();
			КонецЦикла;
			
			РегистрыСведений.ЗапланированныеДействияСФайламиДокументовКЭДО.УдалитьФайлыИзОбработки(
							ОбработанныеФайлы,
							Перечисления.ДействияСФайламиДокументовКЭДО.ПередатьВКабинетСотрудников);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ИнтеграцияУправлениеПерсоналомСобытия.ЗаписатьОшибку(ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

Функция РолиИсполнителейЗадач() Экспорт

	РолиИсполнителейЗадач = БизнесПроцессыЗаявокСотрудников.РолиИсполнителейЗадач();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РолиИсполнителейЗадач", РолиИсполнителейЗадач);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РолиИсполнителей.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.РолиИсполнителей КАК РолиИсполнителей
	|ГДЕ
	|	РолиИсполнителей.Ссылка В(&РолиИсполнителейЗадач)";
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#КонецОбласти
